#include <stdio.h>

int main() {
    int t1, t2, t3;
    double total_time;

    // Зчитуємо значення t1, t2, t3 та перевіряємо чи є вони натуральними числами меншими за 10000
    if (scanf("%d %d %d", &t1, &t2, &t3) != 3) {
        printf("Помилка: значення повинні бути натуральними числами в межах від 1 до 10000\n");
        return 1;
    }

    if (t1 <= 0 || t2 <= 0 || t3 <= 0 || t1 > 10000 || t2 > 10000 || t3 > 10000) {
        printf("Помилка: значення повинні бути натуральними числами в межах від 1 до 10000\n");
        return 1;
    }
    
    // Обчислюємо загальний час, який потрібен гостям. 
    // А саме: одиниця ділиться на суму долей трьох гостей, щоб вирахувати години 
    total_time = (double)(1 / (1.0/t1 + 1.0/t2 + 1.0/t3));

    // Виводимо результат
    printf("Needed time: %.2lf\n", total_time);

    return 0;
}
